{
  "backend/main.mo": "Main Motoko canister implementing the core backend logic for companies, reviews, official profiles, subscriptions, payments, evidence storage, access control, and moderation using ordered maps and multiple supporting modules (Stripe, blob storage, approvals). It defines all primary data types and maintains state for companies, reviews, ratings, official responses, files, and user workflows.",
  "feature_evidence.json": "Feature specification describing three related frontend features to fix and unify multi-file evidence ZIP downloads, ensuring consistent access control, binary-safe fetching, and shared download logic across UI entry points. Includes affected files, dependencies, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Pre-written summary document mapping frontend file paths to concise descriptions of their responsibilities, recent changes, and behavior across components, hooks, pages, and styling. Used as a high-level reference for frontend architecture and modifications.",
  "frontend/index.html": "Main HTML entry point defining metadata, SEO tags, Open Graph settings, favicon, canonical URL handling, and the root mount point for the React application. Sets language to Bulgarian and loads the Vite-powered React bundle.",
  "frontend/src/App.tsx": "Root React component managing application state, page navigation, authentication context, user roles, official profile flows, and global modals. Acts as the single routing and role-based behavior controller for all pages.",
  "frontend/src/components/BackToTopButton.tsx": "UI utility component that displays a floating button when the user scrolls down and smoothly scrolls the page back to the top when clicked. Visibility is controlled via a window scroll listener.",
  "frontend/src/components/CompanyCreationModal.tsx": "Modal component for creating new company profiles with form validation, category and city selection, backend integration via React Query hooks, and success/navigation handling. Includes extensive predefined lists for Bulgarian industries and cities.",
  "frontend/src/components/CompanyEditForm.tsx": "React form component for editing company details, using predefined Bulgarian company categories and cities, and submitting updates via a custom hook.",
  "frontend/src/components/CompanyEditHistory.tsx": "Displays a summarized list of company edit history entries with timestamps, editors, reasons, and changed fields, and opens a modal for detailed view.",
  "frontend/src/components/CompanyEditHistoryTimeline.tsx": "Renders a chronological timeline of company edits with reasons and changed fields, including a modal to inspect detailed changes.",
  "frontend/src/components/EditDetailsModal.tsx": "Modal component that shows detailed information about a single company edit, including editor, date, reason, and before/after field values.",
  "frontend/src/components/EvidenceModal.tsx": "Generic modal for viewing, downloading, or opening evidence files (PDF, images, audio, video) fetched from blob storage.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that handles login/logout via Internet Identity and clears React Query cache on logout.",
  "frontend/src/components/MobileMenu.tsx": "Responsive mobile navigation menu that renders page links and a role-based CTA button. The CTA varies by authentication, user role (admin/user), and employer request status, including tooltips for pending states.",
  "frontend/src/components/MultipleEvidenceModal.tsx": "Modal viewer for browsing multiple evidence files with navigation, type detection (image, PDF, audio, video), and per-file preview/download options. Supports cycling through files and bulk download as a ZIP archive.",
  "frontend/src/components/OfficialProfileRequestModal.tsx": "Modal form for submitting an official employer profile request, including company details, EIK auto-suggestions, document upload with validation, and submission state handling. Integrates company lookup and file storage hooks.",
  "frontend/src/components/OfficialResponseEditHistoryTimeline.tsx": "Timeline component displaying the edit history of an official response, sorted by date with editor info, reasons, and changed fields. Includes a modal to view detailed changes for each edit.",
  "frontend/src/components/OfficialResponseModal.tsx": "Modal for creating or editing an official company response to a review, with text content and optional evidence file uploads. Handles authentication checks, upload progress, and differentiates create vs edit workflows.",
  "frontend/src/components/ProfileSetup.tsx": "Status panel showing the current user's official profile request state (pending, approved, or rejected). Fetches request data and conditionally renders explanatory messages and rejection reasons.",
  "frontend/src/components/RatingDisplay.tsx": "Presentational component that renders a star-based rating display with optional label, numeric value, size variants, and review count text.",
  "frontend/src/components/RatingInput.tsx": "Interactive star rating input allowing users to select a value from 1–5, with label, required indicator, hint text, and change callback.",
  "frontend/src/components/RejectionNotification.tsx": "Dismissible and expandable notification banner indicating a rejected application, persisting dismissal in localStorage and opening a modal to view details.",
  "frontend/src/components/RejectionReasonModal.tsx": "Modal dialog that displays the detailed rejection reason text, with graceful handling when no reason is provided.",
  "frontend/src/components/ReviewSubmissionModal.tsx": "Large modal for submitting company reviews with text, multiple category ratings, file uploads with validation, and integration with review submission and identity hooks.",
  "frontend/src/components/SubscriptionModal.tsx": "Modal presenting a subscription plan summary with dynamic pricing, feature list, and placeholder flow for Stripe payment integration.",
  "frontend/src/components/SuggestionModal.tsx": "Modal form for submitting user suggestions with title and content, using dialog UI components, validation, and async submission with success feedback.",
  "frontend/src/config/subscriptionPlans.ts": "Central configuration defining subscription plans, prices, and helper functions to retrieve plans and format pricing.",
  "frontend/src/hooks/useActor.ts": "Custom React Query hook that creates and caches a backend actor based on the current Internet Identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useEvidenceArchiveDownload.ts": "Defines a custom hook intended to download multiple evidence files as a ZIP archive with shared authentication, but currently contains placeholder logic and throws an error because URL resolution via hooks is not implemented.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hooks for authenticating users via Dfinity Internet Identity, managing login state, persisted identities, and exposing login/logout helpers.",
  "frontend/src/hooks/usePdfObjectUrl.ts": "Implements a hook that fetches a remote PDF, converts it to a blob object URL for inline display, and manages loading, error state, and cleanup.",
  "frontend/src/hooks/useQueries.ts": "Centralizes React Query hooks for backend data access, including user context, admin checks, company CRUD operations, and other domain-specific queries and mutations.",
  "frontend/src/index.css": "Configures global Tailwind CSS styles, theme variables for light/dark modes, typography, utilities, animations, and custom UI behaviors like scrollbars and focus styles.",
  "frontend/src/main.tsx": "Application entry point that initializes React, sets up React Query and Internet Identity providers, and renders the root App component.",
  "frontend/src/pages/AdminOfficialProfileRequestsPage.tsx": "Empty or placeholder admin page file with no implemented content.",
  "frontend/src/pages/AdminPage.tsx": "Implements the main admin interface for reviewing official profile requests, including document preview, download actions, approval/rejection flows, and related admin tools.",
  "frontend/src/pages/AdminSuggestionsPage.tsx": "Admin UI for viewing, filtering, searching, and moderating user suggestions, with status transitions enforced by severity rules and toast feedback.",
  "frontend/src/pages/BlockchainPage.tsx": "Static informational page explaining how the platform uses blockchain (ICP) for immutability, timestamps, and security, with navigation back to the landing page.",
  "frontend/src/pages/CompanyPage.tsx": "Detailed company profile page showing reviews, ratings, evidence, official responses, statistics, and edit histories, with extensive filtering, moderation, and interaction features.",
  "frontend/src/pages/EmployersPage.tsx": "Company listing and discovery page with search, filtering by sector, sorting, ratings display, and admin capabilities to create or edit companies.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with hero section, manifesto, and navigation entry point to browse employers, including scroll position management on load.",
  "frontend/src/pages/MyOfficialProfilePage.tsx": "Renders the authenticated user's official company profile dashboard, loading company data, reviews, responses, ratings history, and subscription status, with modals for subscription, profile requests, and editing. Includes analytics charts, rating metrics, and controls to activate/deactivate the official profile.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a payment failure message with options to retry by navigating to the official profile page or return to the landing page.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Shows a payment success confirmation screen and provides navigation back to the user's official profile or the landing page.",
  "frontend/src/pages/PrivacyPage.tsx": "Static privacy policy page describing anonymity, data handling, blockchain storage, and user responsibilities, with navigation back to the landing page.",
  "frontend/src/pages/TermsPage.tsx": "Static terms of service page outlining usage conditions, content responsibility, anonymity, moderation limits, and legal constraints, with navigation back to the landing page.",
  "frontend/src/utils/cityData.ts": "Exports a constant array containing a comprehensive list of Bulgarian city and settlement names for use in forms or selectors.",
  "frontend/src/utils/evidenceArchiveDownload.ts": "Utility for creating a ZIP archive from pre-resolved evidence file URLs using JSZip, fetching files, tracking successes/failures, and returning a downloadable Blob with a summary.",
  "frontend/src/utils/formatters.ts": "Provides helper functions for formatting dates (Bulgarian locale), file sizes, and blockchain hashes, plus utilities for generating review IDs, normalizing website URLs, validating EIK length, and inferring file types from paths.",
  "frontend/src/utils/urlParams.ts": "Utility functions to read URL parameters from query strings or hash-based routing, persist them in sessionStorage, retrieve or clear them, and safely remove sensitive parameters from the URL without reload.",
  "frontend/src/utils/validation.ts": "Contains client-side validation logic for uploaded files (size, total size, type), ratings completeness, and company form data, returning boolean results or localized error messages.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining content paths, dark mode, container settings, extended color tokens via CSS variables, border radii, accordion animations, and UI-related plugins.",
  "project_state.json": "Machine-readable snapshot of the project’s current state, describing the Verithos platform architecture, purpose, and a detailed list of implemented features with versions and metadata."
}