{
  "backend/main.mo": "Main Motoko actor defining state maps and types for companies, reviews, users, official profile requests, responses, subscriptions, and related histories.",
  "feature_evidence.json": "Feature evidence describing the removal of the Statistics UI block from MyOfficialProfilePage.tsx with associated metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files describing their roles, UI behavior, and logic.",
  "frontend/index.html": "HTML entry file setting metadata, favicon, canonical URL, and loading the React application root.",
  "frontend/src/App.tsx": "Main React app component handling routing, user context, navigation, and global UI modals.",
  "frontend/src/components/BackToTopButton.tsx": "Scroll-triggered button that appears after 300px and smoothly scrolls the page to the top.",
  "frontend/src/components/CompanyCreationModal.tsx": "Modal for creating a company with category and city lists, form inputs, validation, and submission via hooks.",
  "frontend/src/components/CompanyEditForm.tsx": "Form for editing company data with sector and city dropdowns and submission via useEditCompany.",
  "frontend/src/components/CompanyEditHistory.tsx": "Displays a collapsible list of recent company edit entries and opens a modal for detailed viewing.",
  "frontend/src/components/CompanyEditHistoryTimeline.tsx": "Renders a chronological timeline of company edits with sortable entries and a modal for change details.",
  "frontend/src/components/EditDetailsModal.tsx": "Modal showing detailed information about a specific company edit, including field-level changes.",
  "frontend/src/components/EvidenceModal.tsx": "Modal for previewing or downloading evidence files with support for PDFs, images, audio, and video.",
  "frontend/src/components/LoginButton.tsx": "Button handling login/logout via Internet Identity with loading states and query cache clearing.",
  "frontend/src/components/MobileMenu.tsx": "Mobile slide‑out menu that renders navigation links and a role/status‑based CTA button for users or admins.",
  "frontend/src/components/MultipleEvidenceModal.tsx": "Modal for browsing multiple evidence files with type detection, navigation controls, and download support.",
  "frontend/src/components/OfficialProfileRequestModal.tsx": "Form modal for submitting an official profile request with validation, file upload, and EIK auto‑suggestions.",
  "frontend/src/components/OfficialResponseEditHistoryTimeline.tsx": "Displays a timeline of official response edits with metadata and a modal for viewing detailed changes.",
  "frontend/src/components/OfficialResponseModal.tsx": "Modal for creating or editing an official response, including content editing and evidence file uploads.",
  "frontend/src/components/ProfileSetup.tsx": "Shows the authenticated user's official profile request status and related messages.",
  "frontend/src/components/RatingDisplay.tsx": "Displays a star rating with optional label, numeric value, and review count.",
  "frontend/src/components/RatingInput.tsx": "Provides an interactive 1–5 star rating input with optional hint and required marker.",
  "frontend/src/components/RejectionNotification.tsx": "Shows a dismissible rejection alert with expandable details and a button to open the reason modal.",
  "frontend/src/components/RejectionReasonModal.tsx": "Modal that displays the rejection reason with close controls.",
  "frontend/src/components/ReviewSubmissionModal.tsx": "Form modal for submitting a company review with text, ratings, and file uploads including validation.",
  "frontend/src/components/SubscriptionModal.tsx": "Modal presenting subscription plan details, pricing, and a notice about unimplemented Stripe payments.",
  "frontend/src/components/SuggestionModal.tsx": "Modal for submitting platform improvement suggestions with title and content fields.",
  "frontend/src/config/subscriptionPlans.ts": "Defines subscription plan configurations and helpers for retrieving plans and formatting prices.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useEvidenceArchiveDownload.ts": "Provides hooks for initiating ZIP archive downloads of evidence files and returning placeholder URL resolutions.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider to manage authentication state, login, and stored identities.",
  "frontend/src/hooks/usePdfObjectUrl.ts": "Fetches a remote PDF as a blob and returns a blob URL with loading and error state for inline rendering.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including users, companies, edits, and admin actions.",
  "frontend/src/index.css": "Tailwind-based global stylesheet defining theme variables, typography, utilities, transitions, and UI component styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminOfficialProfileRequestsPage.tsx": "Empty page file with no implementation.",
  "frontend/src/pages/AdminPage.tsx": "Admin panel page with UI for reviewing and managing official profile requests, document previews, and admin tools.",
  "frontend/src/pages/AdminSuggestionsPage.tsx": "Admin interface to view, filter, search, and update suggestion statuses with validation and status transitions.",
  "frontend/src/pages/BlockchainPage.tsx": "Static informational page explaining how the platform uses blockchain and ICP for integrity, security, and transparency.",
  "frontend/src/pages/CompanyPage.tsx": "Full company detail page showing reviews, evidence, statistics, responses, and edit histories with extensive filtering and interactions.",
  "frontend/src/pages/EmployersPage.tsx": "Company listing page with sorting, filtering by sector, admin editing tools, and navigation to individual company pages.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero content, manifesto sections, and navigation to employer reviews, ensuring scroll reset on load.",
  "frontend/src/pages/MyOfficialProfilePage.tsx": "Handles viewing and managing an employer’s official profile, including subscriptions, reviews, responses, metrics, and editing.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a payment failure message with options to retry or return to the home page.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Shows a payment success confirmation and lets the user return to their profile or the home page.",
  "frontend/src/pages/PrivacyPage.tsx": "Renders the platform’s privacy policy, explaining data handling and anonymity practices.",
  "frontend/src/pages/TermsPage.tsx": "Renders the terms of use, outlining content rules, user responsibilities, and platform limitations.",
  "frontend/src/utils/cityData.ts": "Exports a large list of Bulgarian cities for use in forms or location selection.",
  "frontend/src/utils/evidenceArchiveDownload.ts": "Provides a utility for creating ZIP archives from evidence files using pre-resolved URLs and JSZip.",
  "frontend/src/utils/formatters.ts": "Provides helper functions for formatting dates, file sizes, blockchain hashes, URLs, EIK numbers, and determining file types.",
  "frontend/src/utils/urlParams.ts": "Implements utilities for reading, storing, and clearing URL and session parameters, supporting both query and hash-based routing.",
  "frontend/src/utils/validation.ts": "Contains validation helpers for file sizes and types, rating objects, and company data fields.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, animations, container settings, and plugin integrations.",
  "project_state.json": "Stores project metadata, existing features, and pending requests for removing a Statistics block."
}