{
  "backend/main.mo": "Defines the main Motoko actor with access control, registry mixin, maps for companies, reviews, profiles, official requests/responses, rating data, and subscription-related types.",
  "feature_evidence.json": "Describes a feature update requiring relative URLs in frontend/index.html metadata and lists related components and tests.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for numerous frontend files detailing their purpose and recent functional updates.",
  "frontend/index.html": "HTML entry file setting metadata, favicon, canonical URL, Open Graph tags, DNS prefetching, and bootstrapping the frontend app.",
  "frontend/src/App.tsx": "Main React application component handling routing, authentication, role-based UI logic, and global modals.",
  "frontend/src/components/BackToTopButton.tsx": "Floating button that appears after scrolling and smoothly returns the user to the top of the page.",
  "frontend/src/components/CompanyCreationModal.tsx": "Modal for creating a company with category and city selection, form validation, and backend submission.",
  "frontend/src/components/CompanyEditForm.tsx": "Form component allowing admins to edit company details with category and city dropdowns and submit changes.",
  "frontend/src/components/CompanyEditHistory.tsx": "Displays a compact or full list of company edit history entries with preview modal for detailed changes.",
  "frontend/src/components/CompanyEditHistoryTimeline.tsx": "Renders a chronological timeline of company edits with sortable entries and a modal for detailed change info.",
  "frontend/src/components/EditDetailsModal.tsx": "Modal that shows full details of a single company edit, including changed fields and metadata.",
  "frontend/src/components/EvidenceModal.tsx": "Modal viewer for evidence files supporting preview, download, and opening PDFs, images, audio, or video.",
  "frontend/src/components/LoginButton.tsx": "Authentication button handling Internet Identity login/logout with loading states and query cache clearing.",
  "frontend/src/components/MobileMenu.tsx": "Mobile navigation menu that renders role‑ and status‑specific CTA buttons and page links for authenticated users.",
  "frontend/src/components/MultipleEvidenceModal.tsx": "Modal for previewing multiple evidence files with navigation, file‑type detection, and download options.",
  "frontend/src/components/OfficialProfileRequestModal.tsx": "Form modal for submitting an official profile request with EIK suggestions, validation, and file upload handling.",
  "frontend/src/components/OfficialResponseEditHistoryTimeline.tsx": "Displays a timeline of official response edits with timestamps, editor info, change summaries, and detail modal.",
  "frontend/src/components/OfficialResponseModal.tsx": "Modal for creating or editing an official company response with text input, file uploads, and submission handling.",
  "frontend/src/components/ProfileSetup.tsx": "Shows the current user’s official profile request status with pending, approved, or rejected states.",
  "frontend/src/components/RatingDisplay.tsx": "Displays star ratings with optional label, numeric value, and review count using size-based styles.",
  "frontend/src/components/RatingInput.tsx": "Interactive 1–5 star rating input with optional label, required marker, and hint text.",
  "frontend/src/components/RejectionNotification.tsx": "Shows a dismissible rejection alert with expandable details and a button to view the rejection reason.",
  "frontend/src/components/RejectionReasonModal.tsx": "Modal that displays the detailed rejection reason with close controls.",
  "frontend/src/components/ReviewSubmissionModal.tsx": "Modal for submitting a company review with ratings, text, file uploads, validation, and success handling.",
  "frontend/src/components/SubscriptionModal.tsx": "Modal presenting subscription plan details, pricing, features, and a placeholder payment action.",
  "frontend/src/components/SuggestionModal.tsx": "Dialog for submitting feature suggestions with title, content, validation, and success state.",
  "frontend/src/config/subscriptionPlans.ts": "Defines subscription plan configs and helper functions for retrieval and price formatting.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useEvidenceArchiveDownload.ts": "Provides a hook for initiating ZIP downloads of multiple evidence files and a helper for placeholder URL resolution.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, handling login, stored identities, and auth client creation.",
  "frontend/src/hooks/usePdfObjectUrl.ts": "Fetches a PDF as a blob and returns a safe object URL for inline rendering with cleanup and error handling.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for user context, admin checks, and company-related CRUD operations.",
  "frontend/src/index.css": "Global Tailwind-based styling with variables, theming, typography, utilities, scrollbars, and animations.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider and mounts it to the DOM.",
  "frontend/src/pages/AdminOfficialProfileRequestsPage.tsx": "Empty page placeholder for handling official profile requests.",
  "frontend/src/pages/AdminPage.tsx": "Admin interface for viewing and managing official profile requests with document preview and actions.",
  "frontend/src/pages/AdminSuggestionsPage.tsx": "Admin interface for viewing, filtering, and updating suggestion statuses with validation and toast notifications.",
  "frontend/src/pages/BlockchainPage.tsx": "Static informational page explaining how the platform uses blockchain, with navigation back to landing.",
  "frontend/src/pages/CompanyPage.tsx": "Displays detailed company data, reviews, evidence, and admin tools with extensive filtering, modals, and edit history.",
  "frontend/src/pages/EmployersPage.tsx": "Company directory with filtering, sorting, statistics, and admin creation/edit tools.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page with hero section, manifesto content, and navigation to employers page.",
  "frontend/src/pages/MyOfficialProfilePage.tsx": "React page showing the user's official company profile with metrics, reviews, responses, subscription status, and editing options.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a payment failure message with options to retry or return to the homepage.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Shows a successful payment confirmation and navigation options back to the profile or homepage.",
  "frontend/src/pages/PrivacyPage.tsx": "Static privacy policy page outlining data handling, anonymity, and blockchain storage principles.",
  "frontend/src/pages/TermsPage.tsx": "Static terms of use page describing platform rules, responsibilities, and content restrictions.",
  "frontend/src/utils/cityData.ts": "Exports a large list of Bulgarian city names for use in forms or selection components.",
  "frontend/src/utils/evidenceArchiveDownload.ts": "Utility for creating ZIP archives from evidence files using JSZip and pre-resolved authenticated URLs.",
  "frontend/src/utils/formatters.ts": "Provides helpers for formatting dates, file sizes, blockchain hashes, URLs, and file types.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and persisting URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/src/utils/validation.ts": "Validates file sizes and types, rating values, and required company data fields.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, container settings, and plugin integrations.",
  "project_state.json": "Project state metadata describing schema version, features, issues, and pending requests."
}