{
  "backend/main.mo": "Main Motoko canister defining state maps for companies, reviews, user profiles, official requests/responses, payments, suggestions, and related types.",
  "feature_evidence.json": "Feature evidence file mapping product requirements to affected files, components, and tests for robots.txt and sitemap.xml.",
  "frontend-file-summaries.txt": "Text file containing short descriptions of various frontend files and components for documentation or build reference.",
  "frontend/index.html": "Root HTML document with metadata, canonical tags, favicon, and app bootstrap script.",
  "frontend/public/robots.txt": "Robots.txt allowing all crawling and pointing to the sitemap URL.",
  "frontend/public/sitemap.xml": "Static sitemap listing the homepage with metadata like lastmod and priority.",
  "frontend/src/App.tsx": "Main React app handling routing, user context, authentication, navigation, and modal visibility.",
  "frontend/src/components/BackToTopButton.tsx": "Scroll-dependent button that appears after scrolling and smoothly returns the user to the top.",
  "frontend/src/components/CompanyCreationModal.tsx": "Modal for admins to create companies with fields for categories and Bulgarian cities, using query hooks for submission.",
  "frontend/src/components/CompanyEditForm.tsx": "A form component for editing company details, including category and city selection, using useEditCompany. Handles form submission, validation, and UI interactions.",
  "frontend/src/components/CompanyEditHistory.tsx": "Displays a compact or full list of company edit history entries with formatted metadata and a modal for viewing details. Supports toggling history visibility and selecting specific edits.",
  "frontend/src/components/CompanyEditHistoryTimeline.tsx": "Renders a chronological timeline of company edits with sortable entries and a detail modal. Shows timestamps, editors, reasons, and summaries of changed fields.",
  "frontend/src/components/EditDetailsModal.tsx": "A modal presenting detailed information about a specific company edit, including fields changed, timestamps, and editor data. Supports backdrop close and formatted field rendering.",
  "frontend/src/components/EvidenceModal.tsx": "Displays evidence files (PDF, images, audio, video) with preview, open-in-new-tab, and download options. Fetches file URLs and handles type-specific rendering.",
  "frontend/src/components/LoginButton.tsx": "A login/logout button integrating Internet Identity authentication with React Query cache clearing. Shows status-aware labels and handles auto-recovery for duplicate authentication errors.",
  "frontend/src/components/MobileMenu.tsx": "Mobile navigation menu that shows page links and a dynamic CTA button based on user role and employer request status.",
  "frontend/src/components/MultipleEvidenceModal.tsx": "Modal for previewing, navigating, and downloading multiple evidence files with file-type detection.",
  "frontend/src/components/OfficialProfileRequestModal.tsx": "Form modal allowing users to submit an official profile request with validation, file upload, and company auto-suggestions.",
  "frontend/src/components/OfficialResponseEditHistoryTimeline.tsx": "Displays a timeline of official response edits with timestamps, editor info, change summaries, and a detail modal.",
  "frontend/src/components/OfficialResponseModal.tsx": "Modal for creating or editing an official response, supporting text input, file uploads, and mode-based behavior.",
  "frontend/src/components/ProfileSetup.tsx": "Shows the user's official profile request status with different messages for pending, approved, or rejected states.",
  "frontend/src/components/RatingDisplay.tsx": "Displays star ratings with optional label, value, and review count using dynamic sizes.",
  "frontend/src/components/RatingInput.tsx": "Interactive 1–5 star rating input with label, required marker, and optional hint.",
  "frontend/src/components/RejectionNotification.tsx": "Shows a dismissible rejection banner with expandable details and a button to view the reason.",
  "frontend/src/components/RejectionReasonModal.tsx": "Modal that displays the rejection reason text with close controls.",
  "frontend/src/components/ReviewSubmissionModal.tsx": "Modal for submitting company reviews with multiple ratings, text, file uploads, and validation.",
  "frontend/src/components/SubscriptionModal.tsx": "Displays subscription plan details, pricing, and a warning about unconfigured Stripe payments.",
  "frontend/src/components/SuggestionModal.tsx": "Modal for submitting suggestions with title and content, including validation and success state.",
  "frontend/src/config/subscriptionPlans.ts": "Defines subscription plan configs and helper functions for retrieving plans and formatting prices.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries.",
  "frontend/src/hooks/useEvidenceArchiveDownload.ts": "Provides a hook for downloading multiple evidence files as a ZIP, plus a helper for resolving file URLs; current implementation requires a component to supply resolved URLs.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth provider and hook managing identity loading, login, logout, and status tracking using Dfinity AuthClient.",
  "frontend/src/hooks/usePdfObjectUrl.ts": "Fetches a remote PDF and returns a blob URL for inline viewing, with loading and error states and cleanup handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user context, admin checks, companies, and related backend data.",
  "frontend/src/index.css": "Tailwind-based global styles defining themes, typography, utilities, animations, and layout behaviors.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminOfficialProfileRequestsPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/AdminPage.tsx": "Admin UI for managing official profile requests with file previews, actions, filtering, and navigation.",
  "frontend/src/pages/AdminSuggestionsPage.tsx": "Admin page enabling viewing, filtering, searching, and updating suggestion statuses with validation and toast feedback.",
  "frontend/src/pages/BlockchainPage.tsx": "Static informational page explaining how Verithos uses blockchain and ICP for immutability, security, and timestamped records.",
  "frontend/src/pages/CompanyPage.tsx": "Company detail page showing reviews, evidence, statistics, edit history, and official responses with extensive filtering and actions.",
  "frontend/src/pages/EmployersPage.tsx": "Employers listing page with sorting, filtering, sector categories, company creation, and navigation to company details.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero section, manifesto, and navigation to employers, enforcing scroll-to-top behavior on load.",
  "frontend/src/pages/MyOfficialProfilePage.tsx": "Page component showing a user's official company profile with data fetching, metrics, subscription controls, and related modals.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a payment failure message with options to retry or return to the landing page.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Shows a successful payment confirmation and navigation options back to the profile or home page.",
  "frontend/src/pages/PrivacyPage.tsx": "Renders the platform’s privacy policy with navigation back to the landing page.",
  "frontend/src/pages/TermsPage.tsx": "Renders the terms of use, outlining rules and responsibilities for platform usage.",
  "frontend/src/utils/cityData.ts": "Exports a large list of Bulgarian city names for use in forms or selection inputs.",
  "frontend/src/utils/evidenceArchiveDownload.ts": "Utility to create ZIP archives from evidence files using pre-resolved URLs, handling success and failure tracking.",
  "frontend/src/utils/formatters.ts": "Provides helpers for formatting dates, file sizes, blockchain hashes, URLs, EIK values, and file types.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters, supporting both query and hash routing.",
  "frontend/src/utils/validation.ts": "Implements validation for files, ratings, and company data including size, type, and required fields.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining content paths, theming, animations, and plugins.",
  "project_state.json": "Metadata describing project state, SEO file requirements, and pending feature requests for robots.txt and sitemap.xml."
}