{
  "backend/main.mo": "Main Motoko actor defining state maps, company and review types, official profile and response structures, and integrating access control, blob storage, Stripe, and user approval modules.",
  "feature_evidence.json": "Feature evidence descriptor listing a landing page text change, affected file, related components, and test metadata.",
  "frontend-file-summaries.txt": "Collection of prewritten summaries describing multiple frontend files and their functionality across the application.",
  "frontend/index.html": "HTML entry point setting metadata, SEO tags, favicon, canonical URL, and loading the React app root.",
  "frontend/src/App.tsx": "Main React application container handling routing, authentication, user role logic, official profile flow, and global UI components.",
  "frontend/src/components/BackToTopButton.tsx": "Scroll-triggered floating button that smoothly scrolls the page back to the top.",
  "frontend/src/components/CompanyCreationModal.tsx": "Modal for creating companies with category and city lists, validation, and backend submission via React Query.",
  "frontend/src/components/CompanyEditForm.tsx": "Form component for editing company data, using sector and city lists and submitting edits via a custom hook.",
  "frontend/src/components/CompanyEditHistory.tsx": "Displays a compact or full list of company edit history entries with preview buttons and a details modal.",
  "frontend/src/components/CompanyEditHistoryTimeline.tsx": "Renders a chronological timeline of company edits with expandable details and modal-based change previews.",
  "frontend/src/components/EditDetailsModal.tsx": "Modal showing detailed information about a specific company edit, including changed fields and metadata.",
  "frontend/src/components/EvidenceModal.tsx": "Modal viewer for evidence files supporting PDFs, images, audio, and video with download and open-in-new-tab options.",
  "frontend/src/components/LoginButton.tsx": "Button managing Internet Identity login/logout flow and clearing cached queries on logout.",
  "frontend/src/components/MobileMenu.tsx": "Mobile navigation menu showing links and a role-based CTA button depending on authentication and employer request status.",
  "frontend/src/components/MultipleEvidenceModal.tsx": "Modal for browsing multiple evidence files with file-type detection, navigation, and download support.",
  "frontend/src/components/OfficialProfileRequestModal.tsx": "Modal allowing users to submit an official profile request with company lookup, file upload, validation, and suggestions.",
  "frontend/src/components/OfficialResponseEditHistoryTimeline.tsx": "Timeline displaying sorted edit history for official responses with a modal to view detailed changes.",
  "frontend/src/components/OfficialResponseModal.tsx": "Form modal for creating or editing an official response with text, file uploads, and submission handling.",
  "frontend/src/components/ProfileSetup.tsx": "Component showing the authenticated user's official profile request status with messages for pending, approved, or rejected states.",
  "frontend/src/components/RatingDisplay.tsx": "Displays a star-based rating with optional label, numeric value, and review count.",
  "frontend/src/components/RatingInput.tsx": "Provides interactive star rating input with label, required marker, and optional hint.",
  "frontend/src/components/RejectionNotification.tsx": "Shows a dismissible rejection alert with expandable details and a button to view the rejection reason.",
  "frontend/src/components/RejectionReasonModal.tsx": "Modal presenting the rejection reason text with close controls.",
  "frontend/src/components/ReviewSubmissionModal.tsx": "Modal for submitting a company review with ratings, text, file uploads, and validation.",
  "frontend/src/components/SubscriptionModal.tsx": "Modal displaying subscription plan details, pricing, and a placeholder payment flow.",
  "frontend/src/components/SuggestionModal.tsx": "Dialog for submitting platform improvement suggestions with validation and success state.",
  "frontend/src/config/subscriptionPlans.ts": "Defines subscription plan configurations and helpers for retrieving and formatting plans.",
  "frontend/src/hooks/useActor.ts": "React hook creating and managing an authenticated or anonymous backend actor with query invalidation.",
  "frontend/src/hooks/useEvidenceArchiveDownload.ts": "Provides a hook for triggering multi-file ZIP downloads and a helper to return placeholder resolved file URL data.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines Internet Identity auth context, handles login, stored identity loading, and exposes identity state through a provider and hook.",
  "frontend/src/hooks/usePdfObjectUrl.ts": "Fetches a remote PDF as a blob, returns an object URL for inline viewing, and manages loading and cleanup.",
  "frontend/src/hooks/useQueries.ts": "Implements react-query hooks for backend actor calls, including user context, admin checks, companies, and related mutations.",
  "frontend/src/index.css": "Configures Tailwind layers, theme variables, typography, transitions, and custom UI utility styles.",
  "frontend/src/main.tsx": "Initializes React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminOfficialProfileRequestsPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/AdminPage.tsx": "Admin interface for reviewing official profile requests with document previews, PDF handling, and request approval or rejection.",
  "frontend/src/pages/AdminSuggestionsPage.tsx": "Admin page that lists suggestions, filters them, shows details, and allows status updates with validation.",
  "frontend/src/pages/BlockchainPage.tsx": "Static informational page explaining how Verithos uses blockchain and related concepts.",
  "frontend/src/pages/CompanyPage.tsx": "Displays company details, reviews, evidence, statistics, and allows editing, reporting, supporting, and viewing histories.",
  "frontend/src/pages/EmployersPage.tsx": "Lists companies with filtering, sorting, statistics, and admin creation/editing tools.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero section, manifesto, and navigation to employers; includes scroll-reset logic.",
  "frontend/src/pages/MyOfficialProfilePage.tsx": "Dashboard page showing a company's official profile, metrics, reviews, responses, subscription status, and management actions using multiple data-fetching hooks.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a payment failure message with actions to retry or return to the landing page.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Shows a successful payment confirmation with navigation options back to the user's profile or home.",
  "frontend/src/pages/PrivacyPage.tsx": "Renders the platform’s privacy policy with explanations of data handling, anonymity, and blockchain storage.",
  "frontend/src/pages/TermsPage.tsx": "Displays the platform’s terms of use, outlining rules, responsibilities, and content restrictions.",
  "frontend/src/utils/cityData.ts": "Exports a large list of Bulgarian city names for use in forms or selection components.",
  "frontend/src/utils/evidenceArchiveDownload.ts": "Provides a utility to fetch files via resolved URLs and bundle them into a ZIP archive using JSZip, reporting successes and failures.",
  "frontend/src/utils/formatters.ts": "Provides helpers for formatting dates, file sizes, blockchain hashes, URLs, and determining file types.",
  "frontend/src/utils/urlParams.ts": "Implements utilities for reading, storing, and clearing URL and session parameters, supporting both standard and hash-based routing.",
  "frontend/src/utils/validation.ts": "Contains validation logic for file sizes, file types, rating ranges, and company form data.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, content paths, colors, animations, and plugins.",
  "project_state.json": "Defines project metadata, versioning, and tracked feature requests for the Verithos project."
}