{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 17,
  "summary": "Verithos is a Bulgarian-language, Internet Computer (ICP) web platform for anonymously publishing employee reviews and uploading evidence files about employers (companies identified by ЕИК). It provides a public employer directory and company pages with ratings, review evidence previews/downloads, community actions (support/report), and an employer “official profile” workflow where verified employers can post official responses under reviews. The system is built as a React + TypeScript SPA using Internet Identity for authentication, a Motoko canister backend for business logic and access control, and ICP/Caffeine blob storage (hash-tree based) for evidence file storage. It also includes admin tooling for moderating official profile requests and managing user suggestions, plus informational pages (Blockchain/Terms/Privacy) and payment status pages for Stripe-based subscriptions (partially implemented/disabled in UI).",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication (login/logout) with persistent delegation",
      "synonyms": [
        "ICP Internet Identity auth",
        "II login",
        "delegation identity"
      ],
      "description": "Provides authentication via Internet Identity using AuthClient, persists identity across reloads, supports login/logout, exposes login status flags, and disables idle auto-logout by default.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Backend actor creation per identity with access control initialization",
      "synonyms": [
        "DFINITY actor",
        "createActorWithConfig",
        "initializeAccessControl"
      ],
      "description": "Creates an anonymous or authenticated backend actor based on Internet Identity; authenticated actors call initializeAccessControl and trigger React Query invalidation/refetch when identity changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Unified user context state (role + official profile status) as single source of truth",
      "synonyms": [
        "userContextState",
        "role/status query"
      ],
      "description": "Fetches role (guest/user/admin), official profile request status, and latest rejected request (if any) via a single backend query and exposes it through a dedicated React Query hook.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Role-based access control in backend (admin/user/guest)",
      "synonyms": [
        "RBAC",
        "AccessControl"
      ],
      "description": "Motoko access-control module assigns first initializing principal as admin, subsequent principals as users; guards backend methods (create/edit/report/support/admin actions) accordingly.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Employer directory (company listing) with search, sector filter, and sorting",
      "synonyms": [
        "EmployersPage",
        "company browser"
      ],
      "description": "Lists companies (keyed by ЕИК) with UI controls for search (by name/description/owner/EIK), sector filter, and sorting (name/date/rating; reviews sort currently falls back). Displays per-company cards with sector tags, rating, and basic metadata.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Company creation by authenticated users with duplicate EIK prevention and similar-name warnings",
      "synonyms": [
        "add employer",
        "CompanyCreationModal"
      ],
      "description": "Allows logged-in users to create new companies with required fields (name/description/EIK/sector/city) and optional manager/website. Blocks duplicate ЕИК creation and provides non-blocking similar-name suggestions with navigation to existing profiles.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Company editing for admins and approved employers with mandatory reason and normalization",
      "synonyms": [
        "edit employer",
        "CompanyEditForm"
      ],
      "description": "Enables admins and approved employers to edit company fields (name/description/owner/sector/city/website) with required reason. Website URL is normalized to include protocol. Backend records change diffs and reason in edit history.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Company edit history viewing (timeline + detail modal)",
      "synonyms": [
        "audit trail",
        "CompanyEditHistoryTimeline"
      ],
      "description": "Displays a reverse-chronological timeline of company edits including timestamp, editor principal (abbreviated), reason, and changed fields; supports a detail modal showing old/new values per field.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Company profile page with ratings, statistics, and review browsing",
      "synonyms": [
        "CompanyPage",
        "employer profile"
      ],
      "description": "Shows company details, overall and category ratings, derived statistics (total reviews, evidence count, reported percentage with minimum thresholds), and a review list sorted by newest first. Includes evidence-type filtering and edit-history access.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Review submission with mandatory category ratings and optional evidence uploads",
      "synonyms": [
        "submit review",
        "ReviewSubmissionModal"
      ],
      "description": "Authenticated users can submit text reviews and must provide ratings across five categories (pay, work conditions, management, job security, other). Optional evidence files can be uploaded with validation (100MB per file, 300MB total), filename sanitization, and storage path organization by company.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Evidence file storage on ICP/Caffeine gateway with hash trees and ownership enforcement",
      "synonyms": [
        "blob storage",
        "StorageClient",
        "FileStorage hooks"
      ],
      "description": "Uploads files by chunking, hashing (SHA-256), building a blob hash tree, uploading to a gateway with certificate auth, and registering path→hash in a backend registry. Backend tracks file ownership (path→principal) and enforces ownership when referencing evidence in reviews/official responses.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Evidence preview and download UX (single-file modal + multi-file gallery + ZIP export)",
      "synonyms": [
        "EvidenceModal",
        "MultipleEvidenceModal",
        "download all evidence"
      ],
      "description": "Supports preview of PDFs (iframe), images, audio, and video; provides per-file download and open-in-new-tab actions; multi-evidence gallery navigation with thumbnails; and download-all as a ZIP archive (JSZip) using gateway URLs, including an archive info summary file for failures.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Review engagement: support (thumbs-up) and report (inaccurate content) with counts",
      "synonyms": [
        "supportReview",
        "reportReview"
      ],
      "description": "Authenticated users can support a review (one per user) and report a review (one per user). Report count is stored and retrievable from backend; UI disables repeated actions and displays pluralized counts.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Official profile request submission with EIK autosuggest and confirmation document upload",
      "synonyms": [
        "employer verification",
        "OfficialProfileRequestModal"
      ],
      "description": "Allows users to request an official employer profile for an existing company (validated by ЕИК). Includes EIK autosuggestions, auto-filling company name/website, trade register link input, and uploading a confirmation document (PDF/JPG/PNG). Client-side guards prevent submission when status is pending/approved.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Admin management of official profile requests (approve/reject with mandatory rejection reason)",
      "synonyms": [
        "AdminPage requests tab",
        "official profile moderation"
      ],
      "description": "Admin UI lists requests with filter/search, provides detail modal with inline preview/download of confirmation document, and supports approve/reject. Rejection requires a mandatory reason stored in the request and displayed back to users.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Rejected-request notification banner with persistent dismissal and reason modal",
      "synonyms": [
        "RejectionNotification",
        "RejectionReasonModal"
      ],
      "description": "When a user's request is rejected, shows a dismissible banner (persisted via localStorage) and allows viewing the rejection reason in a modal.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Official responses to reviews for approved employers (create/edit) with evidence support",
      "synonyms": [
        "employer response",
        "OfficialResponseModal"
      ],
      "description": "Users with an approved official profile for a company can post an official response under a review for that company, optionally with evidence files. Editing preserves existing evidence and tracks edit time; authorization is checked via backend.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Official response edit history viewing",
      "synonyms": [
        "OfficialResponseEditHistoryTimeline",
        "response audit trail"
      ],
      "description": "Displays a reverse-chronological edit timeline for official responses with changed fields, editor principal, and a detail modal showing old/new values.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Employer self-service dashboard for approved official profiles",
      "synonyms": [
        "MyOfficialProfilePage",
        "official profile dashboard"
      ],
      "description": "Provides an approved employer dashboard showing company data (with edit option), review/response metrics, category averages computed from reviews, and a rating-over-time chart with time period selection. Subscription UI is hidden, but subscription-related queries and handlers exist.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Subscription plan configuration and Stripe integration scaffolding",
      "synonyms": [
        "subscriptionPlans",
        "Stripe outcalls",
        "checkout sessions"
      ],
      "description": "Centralized frontend subscription plan definitions (e.g., official_profile_monthly). Backend includes Stripe outcall functions to create checkout sessions and query session status; frontend includes payment success/failure pages and a subscription modal with payments disabled when Stripe is not configured.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Public suggestions submission and admin suggestions management",
      "synonyms": [
        "SuggestionModal",
        "AdminSuggestionsPage"
      ],
      "description": "Anyone (including guests) can submit platform improvement suggestions. Admins can list all suggestions, filter/search, view details, and update statuses with downgrade prevention (except rejection allowed anytime).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Informational and policy pages with in-app navigation",
      "synonyms": [
        "LandingPage",
        "BlockchainPage",
        "TermsPage",
        "PrivacyPage"
      ],
      "description": "Implements landing/manifesto page, blockchain explainer, terms of service, and privacy policy pages with consistent navigation and SEO metadata (index.html).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "Responsive navigation, mobile menu CTA logic, and utility UI components",
      "synonyms": [
        "MobileMenu",
        "BackToTopButton"
      ],
      "description": "Includes sticky header, mobile menu with context-sensitive CTA (Admin/Profile/Request/Pending tooltip), suggestion entry point, scroll-to-top behavior, and a back-to-top floating button.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "Reusable ICP deployment build template (React + shadcn/ui + canister manifests + deploy scripts)",
      "synonyms": [
        "build-template",
        "icp.yaml",
        "deploy.sh",
        "canister.yaml",
        "github-export-icp-cli"
      ],
      "description": "Adds a build-template package containing a deployable React + TypeScript + Tailwind/shadcn-ui frontend scaffold and ICP canister configuration (frontend/backend canister.yaml, system IDL), plus build/deploy scripts and image processing utilities for consistent packaging/export.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-fix-the-multi-file-evidence-zip-download-so-it-fetches-evidence-blobs-using-the-exact-same-effective-access-mechanism-as-single-file-downloads-same-url-resolution-and-any-required-auth-headers-so-that-zip-creation-succeeds-whenever-at-least-one-evidence-file-is-accessible",
      "title": "Fix the multi-file evidence ZIP download so it fetches evidence blobs using the exact same effective access mechanism as single-file downloads (same URL resolution and any required auth/headers), so that ZIP creation succeeds whenever at least one evidence file is accessible.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-update-frontend-src-utils-evidencearchivedownload-ts-to-fetch-each-evidence-file-in-a-browser-compatible-way-for-binary-content-arraybuffer-blob-without-relying-on-implicit-content-type-handling-and-ensure-it-works-for-pdfs-images-audio-and-video-evidence-paths",
      "title": "Update `frontend/src/utils/evidenceArchiveDownload.ts` to fetch each evidence file in a browser-compatible way for binary content (ArrayBuffer/Blob), without relying on implicit content-type handling, and ensure it works for PDFs, images, audio, and video evidence paths.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-ensure-both-existing-download-as-archive-entry-points-under-a-review-evidence-list-and-inside-the-multiple-evidence-modal-call-one-shared-zip-download-flow-so-they-cannot-diverge-same-resolver-same-progress-disabled-state-same-success-failure-behavior",
      "title": "Ensure both existing “Download as archive” entry points (under a review evidence list and inside the multiple-evidence modal) call one shared ZIP download flow so they cannot diverge (same resolver, same progress/disabled state, same success/failure behavior).",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [],
  "architecturalNotes": [
    "Frontend is a React + TypeScript single-page app styled with TailwindCSS and shadcn/ui components; UI heavily uses modal-based workflows (creation/editing/submission/review).",
    "Data fetching and state synchronization use @tanstack/react-query with explicit query keys and cache invalidation after mutations.",
    "ICP Internet Identity authentication is wrapped in a context provider (useInternetIdentity) with persistent delegation; login/logout controls are centralized.",
    "Backend integration follows the DFINITY “actor” pattern: a backend actor is created per identity (or anonymously) via createActorWithConfig, and access control is initialized after actor creation.",
    "Backend is a Motoko canister implementing access control (admin/user/guest) and business entities (companies, reviews, official profile requests, official responses, suggestions).",
    "Companies are keyed by Bulgarian registration number (ЕИК) and treated as the canonical identifier throughout the app (companyId/companyEik).",
    "Evidence storage uses a blob-storage gateway client that constructs SHA-256-based hash trees (BlobHashTree) and uploads chunks in parallel with retry/backoff; the backend stores a registry of file references (path → hash) and tracks file ownership (path → principal).",
    "Authorization for referencing evidence paths is enforced in the backend by validating file ownership when submitting reviews/official responses.",
    "Admin workflows are implemented in-app (AdminPage) with search/filter and detail modals; rejection requires a mandatory reason that is persisted and shown to users.",
    "Stripe integration exists in the backend using HTTP outcalls (transform pattern); subscription plan configuration is centralized on the frontend, while UI payment is currently disabled in favor of test activation.",
    "A separate build-template directory was introduced to package/export an ICP-ready React (Vite) + Tailwind + shadcn/ui frontend and backend canister configuration alongside deploy scripts (icp.yaml/deploy.sh), enabling consistent reproducible deployments outside the main app workspace.",
    "Evidence ZIP archive generation/download was refactored into a shared frontend utility (utils/evidenceArchiveDownload.ts) so all “download as archive” entry points use identical logic/behavior.",
    "ZIP generation no longer relies on dynamically loading JSZip from a CDN at runtime; the dependency is bundled locally to avoid CSP/offline failures.",
    "Blob-storage registry/backend logic was updated to reduce/avoid evidence path collisions/overwrites when registering file references (path → hash), improving safety against orphaned/overwritten blobs."
  ],
  "knownIssues": [
    "Rating history is not updated on normal review submissions: submitReview recalculates company averages but does not append to ratingHistory nor store per-timestamp rating snapshots; getRatingHistory returns timestamps but uses a single ratingValues value for all points, making the chart inaccurate/static unless admin updateCompanyRatings is used.",
    "File reference paths can collide (e.g., repeated uploads using the same path/filename) because registerFileReference overwrites the registry entry without marking the previous hash for deletion; this can orphan blobs and/or cause unintended overwrites.",
    "City and category constants are duplicated across multiple components despite the presence of shared utilities (frontend/src/utils/cityData.ts), increasing maintenance overhead.",
    "useGetAllCompanyStatistics currently returns placeholder/empty per-company stats (comment notes it should be backend-side for performance).",
    "Official response edit history reason is hardcoded to \"Edited response\" in the backend (no user-supplied reason), limiting auditability/detail for edits.",
    "ZIP архивиране/„Изтегли като архив“ продължава да се проваля: потребителят вижда „Не успяхме да включим нито един файл в архива. Моля, опитайте отново по-късно.“ въпреки че единичните файлове се теглят успешно; потребителят съобщава и конзолни грешки при опит за ZIP.",
    "ZIP download still failing: single-file downloads succeed, but \"Download as archive\" fails from both review evidence section and the \"all evidence\" modal with message \"Не успяхме да включим нито един файл в архива...\"; console shows blob.caffeine.ai errors (HTTP 400/403) when fetching blobs for ZIP. Needs full ZIP logic fix (likely evidence URL/auth/owner_id/content-type/arrayBuffer handling)."
  ],
  "isFixRequest": true,
  "gameProjectType": "none",
  "projectName": "Verithos",
  "clarification_mode": "pro",
  "clarification_rounds": 0,
  "requiresBackendChanges": false,
  "requiresFrontendChanges": true
}